// ++++++++TASK1
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'. 

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою  
// перетворіть значення на число за допомогою Number().
// const number = Number(prompt("ВВедіть число"));
// if (number === 10) {
//     alert("вірно");
// } else {
//     alert("Невірно");
// }
// const number = Number(prompt("Hello"));
// if (number === 10) {
//     alert("Correct");
// } else {
//     alert("Not");
// }
// number===10? alert ("Yes") : alert("wrong")
// alert(number === 10 ? "Yes" : "wrong");
///===================Task2
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * 59);
// if (min >= 0 && min <= 14) {
//     alert(min + " first quarter");
// } else if (min >= 15 && min <= 29) {
//     alert(min + " second quarter");
// } else if (min >= 30 && min <= 44) {
//     alert(min + " Third quarter");
// } else if (min >= 45 && min <= 59){
//     alert(min + " Four quarter");
// }
// варіант 2 простіший
// if (min < 15) {
//     alert(min + " перша ");
// } else if (min < 30) {
//     alert(min + " друга");
// } else if (min<45 ) {
//     alert(min + " третя");
// } else {
//     alert(min + " четверта");
// }
// ================= task2
// Змінна num може набувати 4 значення: '1', '2', '3' або '4' 
// (запитуй це значення у користувача через prompt). 
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач 
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.
//  Варінт 1
// const num=prompt("Введіть варіант 1-4");
// // if (num === '1') {
// //     alert('зима');
// // } else if (num === '2') {
// //     alert('весна');
// // } else if (num === '3') {
// //     alert('літо');
// // } else if (num === '4') {
// //     alert('осінь');
// // }
// // Варіант 2
// let result;
// switch(num){
//     case '1':
//         result='зима';
//         break;
//     case '2':
//         result='весна';
//         break;
//     case '3':
//         result='літо';
//         break;
//     case '4':
//         result='осінь';
//         break;
//     default:
//         result=('Такої пори року не існує. Введіть число від 1 до 4.');
//     }
// alert(result);
// console.log(result);
//=========== Task Завдання 4:
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'): 
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

// const totalTime = prompt("вкажіть кількість хвилин");
// const hours = Math.floor(totalTime / 60);
// const minutes = totalTime % 60;

// const formatedHours = String(hours).padStart(2, '0');
// const formatedMinutes = String(minutes).padStart(2, '0');


// console.log(`${formatedHours} : ${formatedMinutes}`);
//+===================Завдання 5:
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"
// let pass = undefined;
// const login = prompt('введіть логін');
// if (!login) {
//     alert("Скасовано");
// } else if (login === "Адмін") {
//     pass = prompt("Введіть пароль");
//     if (!pass) {
//         alert("Скасовано");
//     } else if (pass === "Я головний") {
//         alert("Добрий день!");
//     } else {
//         alert("Невірний пароль!");
//     }
// } else {
//     alert('Я вас не знаю');
// }
//============Завдання 6:
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.
// let i = 0;
// while (i <= 20) {
//     console.log(i);
//     i++;
// }
//==============Завдання 7:
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри - 
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.
// function getNumbers(min, max) {
//     let summ = 0;
//     for (let i = max; i >= min; i--){
        
//         console.log(i);
         
//         if (i % 2 === 0){
//             summ  += i;
//         }
//     }
//     return summ;
// }
// console.log(getNumbers(5,10));
//====================Завдання 8:
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.
// мій варіант
// function min(a, b) {
//     let result = undefined;
//     if (typeof a !== 'number' || typeof b !== 'number') {
//         result= `Not a number!`;
//     } else if (a < b) {
//         result= a;
//     } else if (a > b) {
//         result= b;
//     }
//     return result;
// }
// console.log(min(21,10));
// оптимізований варіант geminy
// function min(a, b) {
//     // 1. Перевірка на тип даних
//     if (typeof a !== 'number' || typeof b !== 'number') {
//         return 'Not a number!';
//     }

//     // 2. Логіка порівняння
//     // Якщо a менше b, повертаємо a. В усіх інших випадках (b менше або вони рівні) — повертаємо b.
//     return a < b ? a : b;
// // Тернарний оператор (? :): Робить код чистішим, коли у нас проста логіка "якщо так — одне, інакше — інше".
// }

// // Перевірка
// console.log(min(21, 10));   // 10
// console.log(min(5, 5));     // 5
// console.log(min(7, '10'));  // Not a number!
//=================Завдання 9:

// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true, 
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm 
// і повертає його результат (true/false).
// function isAdult(age) {
//     // 1. Перевіряємо, чи вік 18 або більше
//     if (age >= 18) {
//         return true;
//     }

//     // 2. Якщо умова вище не виконалася, запитуємо підтвердження
//     // Результат confirm (true або false) одразу повертається з функції
//     return confirm('Батьки дозволили вам перегляд цього контенту?');
// }

// // Приклад використання:
// let accessAllowed = isAdult(16); 
// console.log(accessAllowed); // Буде true, якщо натиснути "ОК", і false, якщо "Скасувати"

//================ Завдання 10
// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.
// Мій варіант
// function fizzBuzz(num) {
//     for (let i = 1; i <= num; i++) {
//         if (i % 3 === 0 && i % 5 === 0) {
//              console.log('fizzbuzz');
//         } else if(i % 3 === 0) {
//                 console.log('fizz');
//             } else if ( i% 5 === 0) {
//                 console.log('buzz');
//             }
        
//     }
// }
// fizzBuzz(17);   
// Варіант Geminy
// function fizzBuzz(num) {
//     for (let i = 1; i <= num; i++) { 
//         if (i % 3 === 0 && i % 5 === 0) {
//             console.log('fizzbuzz');
//         } else if (i % 3 === 0) {
//             console.log('fizz');
//         } else if (i % 5 === 0) {
//             console.log('buzz');
//         } else {
//             console.log(i); // Виводимо число, якщо воно не підійшло під умови
//         }
//     }
// }

// fizzBuzz(17);