// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'. 

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою  
// перетворіть значення на число за допомогою Number().

// const number = Number(prompt("Hello"));
// if (number === 10) {
//     alert("Correct");
// } else {
//     alert("Not");
// }

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

const min = Math.floor(Math.random() * 59);

if (min >= 0 && min <= 14) {
    alert(min + " перша ");
} else if (min >= 15 && min <= 29) {
    alert(min + " друга");
} else if (min >= 30 && min <= 44) {
    alert(min + " третя");
} else if (min >= 45 && min <= 59) {
    alert(min + " четверта");
}

